test/nexj/core/persistence/sql/data/readGroupByCursorCol.xml

<nv:Envelope xmlns:nv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <nv:Body xmlns:ns="http://www.nexjsystems.com/xml-soap" nv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <ns:Array>
         <items nc:arrayType="xs:anyType[8]">
            <Item href="#a"/>
            <Item href="#b"/>
            <Item href="#c"/>
            <Item href="#d"/>
            <Item href="#e"/>
            <Item href="#f"/>
            <Item href="#g"/>
            <Item href="#h"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="a">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>c</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:long">2</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="b">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>c</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:long">2</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="c">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>c</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:long">2</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="d">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>c</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:long">2</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="e">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>c</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:long">2</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="f">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>c</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:long">2</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="g">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>c</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:long">2</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="h">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>c</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:long">2</Item>
         </values>
      </ns:TransferObject>
   </nv:Body>
</nv:Envelope>
